Revit 2026 API

# ClipPlane Constructor

---

Constructs a copy of the clip plane.

**Namespace:** Autodesk.Revit.DB.DirectContext3D**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ClipPlane(
	ClipPlane other
)
```
```vb
Public Sub New (
	other As ClipPlane
)
```
```cpp
public:
ClipPlane(
	ClipPlane^ other
)
```
```fsharp
new :
        other : ClipPlane -> ClipPlane
```

#### Parameters

other ClipPlane

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

ClipPlane Class

Autodesk.Revit.DB.DirectContext3D Namespace